shoes_api/app/controllers/shoes_controller.rb

  def index
    @shoes = Shoe.all
---
SELECT "shoes".* FROM "shoes"

  def create
    @shoe = Shoe.new(shoe_params)

    if @shoe.save
---
INSERT INTO "shoes" ("name", "brand", "qty", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Air Force"], ["brand", "Nike"], ["qty", 28], ["created_at", "2020-04-03 14:30:22.675051"], ["updated_at", "2020-04-03 14:30:22.675051"]]

  def update
    if @shoe.update(shoe_params)
---
UPDATE "shoes" SET "name" = $1, "qty" = $2, "updated_at" = $3 WHERE "shoes"."id" = $4  [["name", "Air Force One"], ["qty", 50], ["updated_at", "2020-04-03 15:39:32.630877"], ["id", 5]]

  def destroy
    @shoe.destroy
---
DELETE FROM "shoes" WHERE "shoes"."id" = $1  [["id", 5]]

    def set_shoe
      @shoe = Shoe.find(params[:id])
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]